exports.activeAcc = (url, token) => {
    return `
    <h2>لطفا ایمیل خود را تایید کنید</h2>
    </br>
    <p>
        از شما بابت استفاده از باشگاه یار تشکر میکنیم  
        </br>
    </p>
    <span>:توجه</span>
    <p>
        اگر این کار را شما نکرده اید از ورود به لینک زیر خودداری نمایید
        </br>
        </br>
        </br>
        اگر قادر به استفاده از لینک زیر نیستید از باز بودن دسترسی برای استقاده از لینک اطمینان حاصل فرمایید
    </p>
    </br>
    <p>
        برای تایید حساب کاربری خود بر روی لینک زیر کلیک کنید یا لینک را به صورت دستی کپی کرده و از آن استفاده کنید
    </p>
    <a href=${url}/dashboard/active-account/${token}>فعال کردن حساب کاربری</a>
`
}

exports.changePass = (url, token) => {
    return `
    <h2>نغییر رمز ورودی</h2>
    </br>
    <p>
        از شما بابت استفاده از باشگاه یار تشکر میکنیم  
        </br>
    </p>
    <span>:توجه</span>
    <p>
        اگر این کار را شما نکرده اید از ورود به لینک زیر خودداری نمایید
        </br>
        </br>
        </br>
        اگر قادر به استفاده از لینک زیر نیستید از باز بودن دسترسی برای استقاده از لینک اطمینان حاصل فرمایید
    </p>
    </br>
    <p>
        برای تغییر رمز ورودی خود بر روی لینک زیر کلیک کرده یا آن را به صورت دستی کپی کنید و استفاده کنید
    </p>
    <a href=${url}/dashboard/profile/change-pass/${token}>تغییر رمز عبور</a>
`
}

exports.forgotPass = (url, token) => {
    return `
    <h2>آیا رمز خود را فراموش کرده اید ؟</h2>
    </br>
    <p>
        از شما بابت استفاده از باشگاه یار تشکر میکنیم  
        </br>
    </p>
    <span>:توجه</span>
    <p>
        اگر این کار را شما نکرده اید از ورود به لینک زیر خودداری نمایید
        </br>
        </br>
        </br>
        اگر قادر به استفاده از لینک زیر نیستید از باز بودن دسترسی برای استقاده از لینک اطمینان حاصل فرمایید
    </p>
    </br>
    <p>
        برای تغییر رمز عبور خود بر روی لینک زیر کلیک کنید یا لینک را به صورت دستی کپی کرده و از آن استفاده کنید
    </p>
    <a href=${url}/forgot-pass/token/${token}>تغییر رمز عبور</a>
`
}