const activeEmailHtml = (url, token) => {
    return `
    <h2>لطفا ایمیل خود را تایید کنید</h2>
    </br>
    <p>
        از شما بابت استفاده از باشگاه یار تشکر میکنیم  
        </br>
    </p>
    <span>:توجه</span>
    <p>
        اگر این کار را شما نکرده اید از ورود به لینک زیر خودداری نمایید
        </br>
        </br>
        </br>
        اگر قادر به استفاده از لینک زیر نیستید از باز بودن دسترسی برای استقاده از لینک اطمینان حاصل فرمایید
    </p>
    </br>
    <p>
        برای تایید حساب کاربری خود بر روی لینک زیر کلیک کنید یا لینک را به صورت دستی کپی کرده و از آن استفاده کنید
    </p>
    <a href=${url}/${token}>فعال کردن حساب کاربری</a>
`
}

const resetAccountPassword = (url, token) => {
    return `
    <h2>نغییر رمز ورودی</h2>
    </br>
    <p>
        از شما بابت استفاده از باشگاه یار تشکر میکنیم  
        </br>
    </p>
    <span>:توجه</span>
    <p>
        اگر این کار را شما نکرده اید از ورود به لینک زیر خودداری نمایید
        </br>
        </br>
        </br>
        اگر قادر به استفاده از لینک زیر نیستید از باز بودن دسترسی برای استقاده از لینک اطمینان حاصل فرمایید
    </p>
    </br>
    <p>
        برای تغییر رمز ورودی خود بر روی لینک زیر کلیک کرده یا آن را به صورت دستی کپی کنید و استفاده کنید
    </p>
    <a href=${url}/${token}>تغییر رمز عبور</a>
`
}

const forgotAccountPassword = (url, token) => {
    return `
    <h2>آیا رمز خود را فراموش کرده اید ؟</h2>
    </br>
    <p>
        از شما بابت استفاده از باشگاه یار تشکر میکنیم  
        </br>
    </p>
    <span>:توجه</span>
    <p>
        اگر این کار را شما نکرده اید از ورود به لینک زیر خودداری نمایید
        </br>
        </br>
        </br>
        اگر قادر به استفاده از لینک زیر نیستید از باز بودن دسترسی برای استقاده از لینک اطمینان حاصل فرمایید
    </p>
    </br>
    <p>
        برای تغییر رمز عبور خود بر روی لینک زیر کلیک کنید یا لینک را به صورت دستی کپی کرده و از آن استفاده کنید
    </p>
    <a href=${url}/${token}>تغییر رمز عبور</a>
`
}

const deleteAccountHtml = (url, token) => {
    return `
    <h2></h2>
    </br>
    <p>
        از شما بابت استفاده از باشگاه یار تشکر میکنیم  
        </br>
    </p>
    <span>:توجه</span>
    <p>
        اگر این کار را شما نکرده اید از ورود به لینک زیر خودداری نمایید
        </br>
        </br>
        </br>
        اگر قادر به استفاده از لینک زیر نیستید از باز بودن دسترسی برای استقاده از لینک اطمینان حاصل فرمایید
    </p>
    </br>
    <p>
        برای پاک کردن حساب کاربری خود بر روی لینک زیر کلیک کنید یا لینک را به صورت دستی کپی کرده و از آن استفاده کنید
        </br>
        </br>
        هشدار: این کار برای همیشه حساب کاربری شما را پاک میکند و دیگر نمی توانید به آن دسترسی داشته باشید
    </p>
    <a href=${url}/${token}>پاک کردن حساب کاربری</a>
`
}

module.exports = { 
    activeEmailHtml, 
    resetAccountPassword, 
    forgotAccountPassword,
    deleteAccountHtml 
}